program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 640, 640]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 640, 640]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [64, 3, 3, 3]> model_0_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1856))), name = tensor<string, []>("model_0_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 3, 3, 3])];
            tensor<fp16, [64]> model_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_0_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2432)))];
            tensor<fp16, [1, 3, 640, 640]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_2")];
            tensor<fp16, [1, 64, 320, 320]> input_1_cast_fp16 = conv(bias = model_0_conv_bias_to_fp16, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = model_0_conv_weight_to_fp16_palettized, x = image_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<fp16, [1, 64, 320, 320]> input_3_cast_fp16 = silu(x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_5_strides_0 = const()[name = tensor<string, []>("input_5_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_5_dilations_0 = const()[name = tensor<string, []>("input_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_5_groups_0 = const()[name = tensor<string, []>("input_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 3, 3]> model_1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [73728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2624))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76416))), name = tensor<string, []>("model_1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 64, 3, 3])];
            tensor<fp16, [128]> model_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76992)))];
            tensor<fp16, [1, 128, 160, 160]> input_5_cast_fp16 = conv(bias = model_1_conv_bias_to_fp16, dilations = input_5_dilations_0, groups = input_5_groups_0, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = input_5_strides_0, weight = model_1_conv_weight_to_fp16_palettized, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 128, 160, 160]> input_7_cast_fp16 = silu(x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, []> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<int32, []>(1)];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> model_2_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [16384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77312))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93760))), name = tensor<string, []>("model_2_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 1, 1])];
            tensor<fp16, [128]> model_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94336)))];
            tensor<fp16, [1, 128, 160, 160]> input_9_cast_fp16 = conv(bias = model_2_cv1_conv_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = model_2_cv1_conv_weight_to_fp16_palettized, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [1, 128, 160, 160]> var_83_cast_fp16 = silu(x = input_9_cast_fp16)[name = tensor<string, []>("op_83_cast_fp16")];
            tensor<int32, [2]> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_85_axis_0 = const()[name = tensor<string, []>("op_85_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 160, 160]> var_85_cast_fp16_0, tensor<fp16, [1, 64, 160, 160]> var_85_cast_fp16_1 = split(axis = var_85_axis_0, split_sizes = var_84, x = var_83_cast_fp16)[name = tensor<string, []>("op_85_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 1, 1]> model_2_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94656))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96768))), name = tensor<string, []>("model_2_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 64, 1, 1])];
            tensor<fp16, [32]> model_2_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97344)))];
            tensor<fp16, [1, 32, 160, 160]> input_13_cast_fp16 = conv(bias = model_2_m_0_cv1_conv_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = model_2_m_0_cv1_conv_weight_to_fp16_palettized, x = var_85_cast_fp16_1)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> input_15_cast_fp16 = silu(x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_17_strides_0 = const()[name = tensor<string, []>("input_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_17_dilations_0 = const()[name = tensor<string, []>("input_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_17_groups_0 = const()[name = tensor<string, []>("input_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> model_2_m_0_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97472))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(106752))), name = tensor<string, []>("model_2_m_0_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 32, 3, 3])];
            tensor<fp16, [32]> model_2_m_0_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107328)))];
            tensor<fp16, [1, 32, 160, 160]> input_17_cast_fp16 = conv(bias = model_2_m_0_m_0_cv1_conv_bias_to_fp16, dilations = input_17_dilations_0, groups = input_17_groups_0, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = input_17_strides_0, weight = model_2_m_0_m_0_cv1_conv_weight_to_fp16_palettized, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> input_19_cast_fp16 = silu(x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> model_2_m_0_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107456))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116736))), name = tensor<string, []>("model_2_m_0_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 32, 3, 3])];
            tensor<fp16, [32]> model_2_m_0_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117312)))];
            tensor<fp16, [1, 32, 160, 160]> input_21_cast_fp16 = conv(bias = model_2_m_0_m_0_cv2_conv_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = model_2_m_0_m_0_cv2_conv_weight_to_fp16_palettized, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> var_122_cast_fp16 = silu(x = input_21_cast_fp16)[name = tensor<string, []>("op_122_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> input_23_cast_fp16 = add(x = input_15_cast_fp16, y = var_122_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_25_strides_0 = const()[name = tensor<string, []>("input_25_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_25_dilations_0 = const()[name = tensor<string, []>("input_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_25_groups_0 = const()[name = tensor<string, []>("input_25_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> model_2_m_0_m_1_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117440))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126720))), name = tensor<string, []>("model_2_m_0_m_1_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 32, 3, 3])];
            tensor<fp16, [32]> model_2_m_0_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(127296)))];
            tensor<fp16, [1, 32, 160, 160]> input_25_cast_fp16 = conv(bias = model_2_m_0_m_1_cv1_conv_bias_to_fp16, dilations = input_25_dilations_0, groups = input_25_groups_0, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = input_25_strides_0, weight = model_2_m_0_m_1_cv1_conv_weight_to_fp16_palettized, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> input_27_cast_fp16 = silu(x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_29_strides_0 = const()[name = tensor<string, []>("input_29_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_29_dilations_0 = const()[name = tensor<string, []>("input_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_29_groups_0 = const()[name = tensor<string, []>("input_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> model_2_m_0_m_1_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9216]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(127424))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136704))), name = tensor<string, []>("model_2_m_0_m_1_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 32, 3, 3])];
            tensor<fp16, [32]> model_2_m_0_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137280)))];
            tensor<fp16, [1, 32, 160, 160]> input_29_cast_fp16 = conv(bias = model_2_m_0_m_1_cv2_conv_bias_to_fp16, dilations = input_29_dilations_0, groups = input_29_groups_0, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = input_29_strides_0, weight = model_2_m_0_m_1_cv2_conv_weight_to_fp16_palettized, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> var_143_cast_fp16 = silu(x = input_29_cast_fp16)[name = tensor<string, []>("op_143_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> var_144_cast_fp16 = add(x = input_23_cast_fp16, y = var_143_cast_fp16)[name = tensor<string, []>("op_144_cast_fp16")];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_31_strides_0 = const()[name = tensor<string, []>("input_31_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_31_dilations_0 = const()[name = tensor<string, []>("input_31_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_31_groups_0 = const()[name = tensor<string, []>("input_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 64, 1, 1]> model_2_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137408))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139520))), name = tensor<string, []>("model_2_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([32, 64, 1, 1])];
            tensor<fp16, [32]> model_2_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140096)))];
            tensor<fp16, [1, 32, 160, 160]> input_31_cast_fp16 = conv(bias = model_2_m_0_cv2_conv_bias_to_fp16, dilations = input_31_dilations_0, groups = input_31_groups_0, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = input_31_strides_0, weight = model_2_m_0_cv2_conv_weight_to_fp16_palettized, x = var_85_cast_fp16_1)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [1, 32, 160, 160]> var_153_cast_fp16 = silu(x = input_31_cast_fp16)[name = tensor<string, []>("op_153_cast_fp16")];
            tensor<bool, []> input_33_interleave_0 = const()[name = tensor<string, []>("input_33_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 64, 160, 160]> input_33_cast_fp16 = concat(axis = var_70, interleave = input_33_interleave_0, values = (var_144_cast_fp16, var_153_cast_fp16))[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_35_strides_0 = const()[name = tensor<string, []>("input_35_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_35_dilations_0 = const()[name = tensor<string, []>("input_35_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_35_groups_0 = const()[name = tensor<string, []>("input_35_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 1, 1]> model_2_m_0_cv3_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [4096]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140224))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(144384))), name = tensor<string, []>("model_2_m_0_cv3_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 1, 1])];
            tensor<fp16, [64]> model_2_m_0_cv3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv3_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(144960)))];
            tensor<fp16, [1, 64, 160, 160]> input_35_cast_fp16 = conv(bias = model_2_m_0_cv3_conv_bias_to_fp16, dilations = input_35_dilations_0, groups = input_35_groups_0, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = input_35_strides_0, weight = model_2_m_0_cv3_conv_weight_to_fp16_palettized, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [1, 64, 160, 160]> var_164_cast_fp16 = silu(x = input_35_cast_fp16)[name = tensor<string, []>("op_164_cast_fp16")];
            tensor<bool, []> input_37_interleave_0 = const()[name = tensor<string, []>("input_37_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 160, 160]> input_37_cast_fp16 = concat(axis = var_70, interleave = input_37_interleave_0, values = (var_85_cast_fp16_0, var_85_cast_fp16_1, var_164_cast_fp16))[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> input_39_pad_type_0 = const()[name = tensor<string, []>("input_39_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_39_strides_0 = const()[name = tensor<string, []>("input_39_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_39_pad_0 = const()[name = tensor<string, []>("input_39_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_39_dilations_0 = const()[name = tensor<string, []>("input_39_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_39_groups_0 = const()[name = tensor<string, []>("input_39_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 192, 1, 1]> model_2_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [49152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145152))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(194368))), name = tensor<string, []>("model_2_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 192, 1, 1])];
            tensor<fp16, [256]> model_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(194944)))];
            tensor<fp16, [1, 256, 160, 160]> input_39_cast_fp16 = conv(bias = model_2_cv2_conv_bias_to_fp16, dilations = input_39_dilations_0, groups = input_39_groups_0, pad = input_39_pad_0, pad_type = input_39_pad_type_0, strides = input_39_strides_0, weight = model_2_cv2_conv_weight_to_fp16_palettized, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [1, 256, 160, 160]> input_41_cast_fp16 = silu(x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> input_43_pad_type_0 = const()[name = tensor<string, []>("input_43_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_43_pad_0 = const()[name = tensor<string, []>("input_43_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_43_strides_0 = const()[name = tensor<string, []>("input_43_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_43_dilations_0 = const()[name = tensor<string, []>("input_43_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_43_groups_0 = const()[name = tensor<string, []>("input_43_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 3, 3]> model_3_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [589824]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195520))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(785408))), name = tensor<string, []>("model_3_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 256, 3, 3])];
            tensor<fp16, [256]> model_3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_3_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(785984)))];
            tensor<fp16, [1, 256, 80, 80]> input_43_cast_fp16 = conv(bias = model_3_conv_bias_to_fp16, dilations = input_43_dilations_0, groups = input_43_groups_0, pad = input_43_pad_0, pad_type = input_43_pad_type_0, strides = input_43_strides_0, weight = model_3_conv_weight_to_fp16_palettized, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [1, 256, 80, 80]> input_45_cast_fp16 = silu(x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<int32, []> var_194 = const()[name = tensor<string, []>("op_194"), val = tensor<int32, []>(1)];
            tensor<string, []> input_47_pad_type_0 = const()[name = tensor<string, []>("input_47_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_47_strides_0 = const()[name = tensor<string, []>("input_47_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_47_pad_0 = const()[name = tensor<string, []>("input_47_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_47_dilations_0 = const()[name = tensor<string, []>("input_47_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_47_groups_0 = const()[name = tensor<string, []>("input_47_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> model_4_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(786560))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(852160))), name = tensor<string, []>("model_4_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([256, 256, 1, 1])];
            tensor<fp16, [256]> model_4_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(852736)))];
            tensor<fp16, [1, 256, 80, 80]> input_47_cast_fp16 = conv(bias = model_4_cv1_conv_bias_to_fp16, dilations = input_47_dilations_0, groups = input_47_groups_0, pad = input_47_pad_0, pad_type = input_47_pad_type_0, strides = input_47_strides_0, weight = model_4_cv1_conv_weight_to_fp16_palettized, x = input_45_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [1, 256, 80, 80]> var_207_cast_fp16 = silu(x = input_47_cast_fp16)[name = tensor<string, []>("op_207_cast_fp16")];
            tensor<int32, [2]> var_208 = const()[name = tensor<string, []>("op_208"), val = tensor<int32, [2]>([128, 128])];
            tensor<int32, []> var_209_axis_0 = const()[name = tensor<string, []>("op_209_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 128, 80, 80]> var_209_cast_fp16_0, tensor<fp16, [1, 128, 80, 80]> var_209_cast_fp16_1 = split(axis = var_209_axis_0, split_sizes = var_208, x = var_207_cast_fp16)[name = tensor<string, []>("op_209_cast_fp16")];
            tensor<string, []> input_51_pad_type_0 = const()[name = tensor<string, []>("input_51_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_51_strides_0 = const()[name = tensor<string, []>("input_51_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_51_pad_0 = const()[name = tensor<string, []>("input_51_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_51_dilations_0 = const()[name = tensor<string, []>("input_51_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_51_groups_0 = const()[name = tensor<string, []>("input_51_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 128, 1, 1]> model_4_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [8192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(853312))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(861568))), name = tensor<string, []>("model_4_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 128, 1, 1])];
            tensor<fp16, [64]> model_4_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(862144)))];
            tensor<fp16, [1, 64, 80, 80]> input_51_cast_fp16 = conv(bias = model_4_m_0_cv1_conv_bias_to_fp16, dilations = input_51_dilations_0, groups = input_51_groups_0, pad = input_51_pad_0, pad_type = input_51_pad_type_0, strides = input_51_strides_0, weight = model_4_m_0_cv1_conv_weight_to_fp16_palettized, x = var_209_cast_fp16_1)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_53_cast_fp16 = silu(x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<string, []> input_55_pad_type_0 = const()[name = tensor<string, []>("input_55_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_55_pad_0 = const()[name = tensor<string, []>("input_55_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_55_strides_0 = const()[name = tensor<string, []>("input_55_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_55_dilations_0 = const()[name = tensor<string, []>("input_55_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_55_groups_0 = const()[name = tensor<string, []>("input_55_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> model_4_m_0_m_0_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(862336))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(899264))), name = tensor<string, []>("model_4_m_0_m_0_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_4_m_0_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(899840)))];
            tensor<fp16, [1, 64, 80, 80]> input_55_cast_fp16 = conv(bias = model_4_m_0_m_0_cv1_conv_bias_to_fp16, dilations = input_55_dilations_0, groups = input_55_groups_0, pad = input_55_pad_0, pad_type = input_55_pad_type_0, strides = input_55_strides_0, weight = model_4_m_0_m_0_cv1_conv_weight_to_fp16_palettized, x = input_53_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_57_cast_fp16 = silu(x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<string, []> input_59_pad_type_0 = const()[name = tensor<string, []>("input_59_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_59_pad_0 = const()[name = tensor<string, []>("input_59_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_59_strides_0 = const()[name = tensor<string, []>("input_59_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_59_dilations_0 = const()[name = tensor<string, []>("input_59_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_59_groups_0 = const()[name = tensor<string, []>("input_59_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> model_4_m_0_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(900032))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(936960))), name = tensor<string, []>("model_4_m_0_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_4_m_0_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(937536)))];
            tensor<fp16, [1, 64, 80, 80]> input_59_cast_fp16 = conv(bias = model_4_m_0_m_0_cv2_conv_bias_to_fp16, dilations = input_59_dilations_0, groups = input_59_groups_0, pad = input_59_pad_0, pad_type = input_59_pad_type_0, strides = input_59_strides_0, weight = model_4_m_0_m_0_cv2_conv_weight_to_fp16_palettized, x = input_57_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_246_cast_fp16 = silu(x = input_59_cast_fp16)[name = tensor<string, []>("op_246_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_61_cast_fp16 = add(x = input_53_cast_fp16, y = var_246_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<string, []> input_63_pad_type_0 = const()[name = tensor<string, []>("input_63_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_63_pad_0 = const()[name = tensor<string, []>("input_63_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_63_strides_0 = const()[name = tensor<string, []>("input_63_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_63_dilations_0 = const()[name = tensor<string, []>("input_63_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_63_groups_0 = const()[name = tensor<string, []>("input_63_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> model_4_m_0_m_1_cv1_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(937728))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(974656))), name = tensor<string, []>("model_4_m_0_m_1_cv1_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_4_m_0_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(975232)))];
            tensor<fp16, [1, 64, 80, 80]> input_63_cast_fp16 = conv(bias = model_4_m_0_m_1_cv1_conv_bias_to_fp16, dilations = input_63_dilations_0, groups = input_63_groups_0, pad = input_63_pad_0, pad_type = input_63_pad_type_0, strides = input_63_strides_0, weight = model_4_m_0_m_1_cv1_conv_weight_to_fp16_palettized, x = input_61_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> input_65_cast_fp16 = silu(x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<string, []> input_67_pad_type_0 = const()[name = tensor<string, []>("input_67_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_67_pad_0 = const()[name = tensor<string, []>("input_67_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_67_strides_0 = const()[name = tensor<string, []>("input_67_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_67_dilations_0 = const()[name = tensor<string, []>("input_67_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_67_groups_0 = const()[name = tensor<string, []>("input_67_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> model_4_m_0_m_1_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [36864]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(975424))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1012352))), name = tensor<string, []>("model_4_m_0_m_1_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 64, 3, 3])];
            tensor<fp16, [64]> model_4_m_0_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1012928)))];
            tensor<fp16, [1, 64, 80, 80]> input_67_cast_fp16 = conv(bias = model_4_m_0_m_1_cv2_conv_bias_to_fp16, dilations = input_67_dilations_0, groups = input_67_groups_0, pad = input_67_pad_0, pad_type = input_67_pad_type_0, strides = input_67_strides_0, weight = model_4_m_0_m_1_cv2_conv_weight_to_fp16_palettized, x = input_65_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_267_cast_fp16 = silu(x = input_67_cast_fp16)[name = tensor<string, []>("op_267_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_268_cast_fp16 = add(x = input_61_cast_fp16, y = var_267_cast_fp16)[name = tensor<string, []>("op_268_cast_fp16")];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_69_strides_0 = const()[name = tensor<string, []>("input_69_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_69_dilations_0 = const()[name = tensor<string, []>("input_69_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_69_groups_0 = const()[name = tensor<string, []>("input_69_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 128, 1, 1]> model_4_m_0_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [8192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1013120))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1021376))), name = tensor<string, []>("model_4_m_0_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([64, 128, 1, 1])];
            tensor<fp16, [64]> model_4_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1021952)))];
            tensor<fp16, [1, 64, 80, 80]> input_69_cast_fp16 = conv(bias = model_4_m_0_cv2_conv_bias_to_fp16, dilations = input_69_dilations_0, groups = input_69_groups_0, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = input_69_strides_0, weight = model_4_m_0_cv2_conv_weight_to_fp16_palettized, x = var_209_cast_fp16_1)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, [1, 64, 80, 80]> var_277_cast_fp16 = silu(x = input_69_cast_fp16)[name = tensor<string, []>("op_277_cast_fp16")];
            tensor<bool, []> input_71_interleave_0 = const()[name = tensor<string, []>("input_71_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 80, 80]> input_71_cast_fp16 = concat(axis = var_194, interleave = input_71_interleave_0, values = (var_268_cast_fp16, var_277_cast_fp16))[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_73_strides_0 = const()[name = tensor<string, []>("input_73_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_73_dilations_0 = const()[name = tensor<string, []>("input_73_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_73_groups_0 = const()[name = tensor<string, []>("input_73_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> model_4_m_0_cv3_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [16384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1022144))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1038592))), name = tensor<string, []>("model_4_m_0_cv3_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([128, 128, 1, 1])];
            tensor<fp16, [128]> model_4_m_0_cv3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv3_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1039168)))];
            tensor<fp16, [1, 128, 80, 80]> input_73_cast_fp16 = conv(bias = model_4_m_0_cv3_conv_bias_to_fp16, dilations = input_73_dilations_0, groups = input_73_groups_0, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = input_73_strides_0, weight = model_4_m_0_cv3_conv_weight_to_fp16_palettized, x = input_71_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<fp16, [1, 128, 80, 80]> var_288_cast_fp16 = silu(x = input_73_cast_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<bool, []> input_75_interleave_0 = const()[name = tensor<string, []>("input_75_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 384, 80, 80]> input_75_cast_fp16 = concat(axis = var_194, interleave = input_75_interleave_0, values = (var_209_cast_fp16_0, var_209_cast_fp16_1, var_288_cast_fp16))[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_77_strides_0 = const()[name = tensor<string, []>("input_77_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_77_dilations_0 = const()[name = tensor<string, []>("input_77_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_77_groups_0 = const()[name = tensor<string, []>("input_77_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 384, 1, 1]> model_4_cv2_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [196608]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1039488))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1236160))), name = tensor<string, []>("model_4_cv2_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([512, 384, 1, 1])];
            tensor<fp16, [512]> model_4_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_cv2_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1236736)))];
            tensor<fp16, [1, 512, 80, 80]> input_77_cast_fp16 = conv(bias = model_4_cv2_conv_bias_to_fp16, dilations = input_77_dilations_0, groups = input_77_groups_0, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = input_77_strides_0, weight = model_4_cv2_conv_weight_to_fp16_palettized, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, [1, 512, 80, 80]> input_79_cast_fp16 = silu(x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_81_strides_0 = const()[name = tensor<string, []>("input_81_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_81_dilations_0 = const()[name = tensor<string, []>("input_81_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_81_groups_0 = const()[name = tensor<string, []>("input_81_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [512, 512, 3, 3]> model_5_conv_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [2359296]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1237824))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3597184))), name = tensor<string, []>("model_5_conv_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([512, 512, 3, 3])];
            tensor<fp16, [512]> model_5_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_5_conv_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3597760)))];
            tensor<fp16, [1, 512, 40, 40]> input_81_cast_fp16 = conv(bias = model_5_conv_bias_to_fp16, dilations = input_81_dilations_0, groups = input_81_groups_0, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = input_81_strides_0, weight = model_5_conv_weight_to_fp16_palettized, x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, [1, 512, 40, 40]> input_83_cast_fp16 = silu(x = input_81_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<int32, []> var_318 = const()[name = tensor<string, []>("op_318"), val = tensor<int32, []>(1)];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_85_strides_0 = const()[name = tensor<string, []>("input_85_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_85_dilations_0 = const()[name = tensor<string, []>("input_85_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_85_groups_0 = const()[name = tensor<string, []>("input_85_groups_0"), val = tensor<int32, []>(1)];
